{"CommandType":{"value":8,"Value":"Cmdlet"},"Name":"New-AzureADMSConditionalAccessPolicy","Module":"AzureADPreview","NewCommand":"New-MgIdentityConditionalAccessPolicy","NewCommandModule":"Microsoft.Graph.Identity.SignIns","Parameters":{"State":{"Name":"State","NewName":"State","OldType":"System.String","NewType":"System.String","MsgInfo":"","MsgWarning":"","MsgError":""},"GrantControls":{"Name":"GrantControls","NewName":"GrantControls","OldType":"Microsoft.Open.MSGraph.Model.ConditionalAccessGrantControls","NewType":"Microsoft.Graph.PowerShell.Models.IMicrosoftGraphConditionalAccessGrantControls","MsgInfo":"","MsgWarning":"","MsgError":""},"CreatedDateTime":{"Name":"CreatedDateTime","NewName":"CreatedDateTime","OldType":"System.String","NewType":"System.DateTime","MsgInfo":"","MsgWarning":"","MsgError":""},"Conditions":{"Name":"Conditions","NewName":"Conditions","OldType":"Microsoft.Open.MSGraph.Model.ConditionalAccessConditionSet","NewType":"Microsoft.Graph.PowerShell.Models.IMicrosoftGraphConditionalAccessConditionSet1","MsgInfo":"","MsgWarning":"","MsgError":""},"ModifiedDateTime":{"Name":"ModifiedDateTime","NewName":"ModifiedDateTime","OldType":"System.String","NewType":"System.DateTime","MsgInfo":"","MsgWarning":"","MsgError":""},"Id":{"Name":"Id","NewName":"Id","OldType":"System.String","NewType":"System.String","MsgInfo":"","MsgWarning":"","MsgError":""},"DisplayName":{"Name":"DisplayName","NewName":"DisplayName","OldType":"System.String","NewType":"System.String","MsgInfo":"","MsgWarning":"","MsgError":""},"SessionControls":{"Name":"SessionControls","NewName":"SessionControls","OldType":"Microsoft.Open.MSGraph.Model.ConditionalAccessSessionControls","NewType":"Microsoft.Graph.PowerShell.Models.IMicrosoftGraphConditionalAccessSessionControls1","MsgInfo":"","MsgWarning":"","MsgError":""}},"LinkOldCommand":"https://docs.microsoft.com/en-us/powershell/module/AzureADPreview/New-AzureADMSConditionalAccessPolicy","LinkNewCommand":"https://docs.microsoft.com/en-us/powershell/module/Microsoft.Graph.Identity.SignIns/New-MgIdentityConditionalAccessPolicy","LinkExamples":"","LinkApi":"/identity/conditionalAccess/policies","LinkApiDocs":"","ScopesApplication":["Application.Read.All","Policy.Read.All","Policy.ReadWrite.ConditionalAccess"],"ScopesDelegate":["Application.Read.All","Policy.Read.All","Policy.ReadWrite.ConditionalAccess"],"MsgInfo":"","MsgWarning":"","MsgError":"","PSComputerName":"localhost","RunspaceId":"26d05c5c-3e83-4f77-bde3-3a8114726f8b","PSShowComputerName":false}
