{"CommandType":{"value":8,"Value":"Cmdlet"},"Name":"Set-AzureADMSConditionalAccessPolicy","Module":"AzureADPreview","NewCommand":"Update-MgIdentityConditionalAccessPolicy","NewCommandModule":"Microsoft.Graph.Identity.SignIns","Parameters":{"ModifiedDateTime":{"Name":"ModifiedDateTime","NewName":"ModifiedDateTime","OldType":"System.String","NewType":"System.DateTime","MsgInfo":"","MsgWarning":"","MsgError":""},"CreatedDateTime":{"Name":"CreatedDateTime","NewName":"CreatedDateTime","OldType":"System.String","NewType":"System.DateTime","MsgInfo":"","MsgWarning":"","MsgError":""},"PolicyId":{"Name":"PolicyId","NewName":"","OldType":"System.String","NewType":"","MsgInfo":"","MsgWarning":"","MsgError":""},"Id":{"Name":"Id","NewName":"Id","OldType":"System.String","NewType":"System.String","MsgInfo":"","MsgWarning":"","MsgError":""},"GrantControls":{"Name":"GrantControls","NewName":"GrantControls","OldType":"Microsoft.Open.MSGraph.Model.ConditionalAccessGrantControls","NewType":"Microsoft.Graph.PowerShell.Models.IMicrosoftGraphConditionalAccessGrantControls","MsgInfo":"","MsgWarning":"","MsgError":""},"State":{"Name":"State","NewName":"State","OldType":"System.String","NewType":"System.String","MsgInfo":"","MsgWarning":"","MsgError":""},"DisplayName":{"Name":"DisplayName","NewName":"DisplayName","OldType":"System.String","NewType":"System.String","MsgInfo":"","MsgWarning":"","MsgError":""},"SessionControls":{"Name":"SessionControls","NewName":"SessionControls","OldType":"Microsoft.Open.MSGraph.Model.ConditionalAccessSessionControls","NewType":"Microsoft.Graph.PowerShell.Models.IMicrosoftGraphConditionalAccessSessionControls","MsgInfo":"","MsgWarning":"","MsgError":""},"Conditions":{"Name":"Conditions","NewName":"Conditions","OldType":"Microsoft.Open.MSGraph.Model.ConditionalAccessConditionSet","NewType":"Microsoft.Graph.PowerShell.Models.IMicrosoftGraphConditionalAccessConditionSet","MsgInfo":"","MsgWarning":"","MsgError":""}},"LinkOldCommand":"https://docs.microsoft.com/en-us/powershell/module/AzureADPreview/Set-AzureADMSConditionalAccessPolicy","LinkNewCommand":"https://docs.microsoft.com/en-us/powershell/module/Microsoft.Graph.Identity.SignIns/Update-MgIdentityConditionalAccessPolicy","LinkExamples":"https://github.com/orgs/msgraph/discussions?discussions_q=Update-MgIdentityConditionalAccessPolicy","LinkApi":"/identity/conditionalAccess/policies/{conditionalAccessPolicy-id}","LinkApiDocs":"","ScopesApplication":["Application.Read.All","Policy.Read.All","Policy.ReadWrite.ConditionalAccess"],"ScopesDelegate":["Application.Read.All","Policy.Read.All","Policy.ReadWrite.ConditionalAccess"],"MsgInfo":"","MsgWarning":"","MsgError":"","PSComputerName":"localhost","RunspaceId":"10467a48-3ab2-434a-b4fa-1b2c37137093","PSShowComputerName":false}
