{"CommandType":8,"Name":"Set-AzureADMSConditionalAccessPolicy","Module":"AzureAD","NewCommand":"Update-MgIdentityConditionalAccessPolicy","NewCommandModule":"Microsoft.Graph.Identity.SignIns","Parameters":{"PolicyId":{"Name":"PolicyId","NewName":"","OldType":"System.String","NewType":"","MsgInfo":"","MsgWarning":"","MsgError":""},"Conditions":{"Name":"Conditions","NewName":"Conditions","OldType":"Microsoft.Open.MSGraph.Model.ConditionalAccessConditionSet","NewType":"Microsoft.Graph.PowerShell.Models.IMicrosoftGraphConditionalAccessConditionSet1","MsgInfo":"","MsgWarning":"","MsgError":""},"State":{"Name":"State","NewName":"State","OldType":"System.String","NewType":"System.String","MsgInfo":"","MsgWarning":"","MsgError":""},"DisplayName":{"Name":"DisplayName","NewName":"DisplayName","OldType":"System.String","NewType":"System.String","MsgInfo":"","MsgWarning":"","MsgError":""},"GrantControls":{"Name":"GrantControls","NewName":"GrantControls","OldType":"Microsoft.Open.MSGraph.Model.ConditionalAccessGrantControls","NewType":"Microsoft.Graph.PowerShell.Models.IMicrosoftGraphConditionalAccessGrantControls","MsgInfo":"","MsgWarning":"","MsgError":""},"Id":{"Name":"Id","NewName":"Id","OldType":"System.String","NewType":"System.String","MsgInfo":"","MsgWarning":"","MsgError":""},"SessionControls":{"Name":"SessionControls","NewName":"SessionControls","OldType":"Microsoft.Open.MSGraph.Model.ConditionalAccessSessionControls","NewType":"Microsoft.Graph.PowerShell.Models.IMicrosoftGraphConditionalAccessSessionControls1","MsgInfo":"","MsgWarning":"","MsgError":""}},"LinkOldCommand":"https://docs.microsoft.com/en-us/powershell/module/AzureAD/Set-AzureADMSConditionalAccessPolicy","LinkNewCommand":"https://docs.microsoft.com/en-us/powershell/module/Microsoft.Graph.Identity.SignIns/Update-MgIdentityConditionalAccessPolicy","LinkExamples":"","LinkApi":"/identity/conditionalAccess/policies/{conditionalAccessPolicy-id}","LinkApiDocs":"","ScopesApplication":["Application.Read.All","Policy.Read.All","Policy.ReadWrite.ConditionalAccess"],"ScopesDelegate":["Application.Read.All","Policy.Read.All","Policy.ReadWrite.ConditionalAccess"],"MsgInfo":"","MsgWarning":"","MsgError":""}
